<template>
    <div class="px-8 md:px-48 py-12">
        <!-- <a-button @click="backToPrevious" type="link" class="flex items-center"><BackwardOutlined />返回上一页</a-button> -->
        <h1>《服务协议》</h1>

        <h2>一、服务条款的确认和接纳</h2>
        <p>研伴先登社区及其涉及到的服务产品、相关软件的所有权和运作权归大连研伴文化交流中心有限公司 （以下简称研伴文化交流中心）所有， 研伴文化交流中心享有对先登社区服务平台上一切活动的监督、提示、检查、纠正及处罚等权利。用户在注册程序过程中点击'同意'按钮完成注册，即表示用户与研伴文化交流中心已达成协议，自愿接受本服务条款的所有内容。</p>

        <h2>二、服务保护条款</h2>
        <ol>
            <li>研伴文化交流中心运用自己的操作系统通过国际互联网络为用户提供各项服务，用户必须：
                <ul>
                    <li> ▪ 提供设备，包括个人手机、电脑一台、调制解调器一个及配备上网装置。</li>
                    <li> ▪ 个人上网和支付与此服务有关的电话费用。</li>
                </ul>
            </li>
            <li>考虑到研伴文化交流中心产品服务的重要性，用户同意：
                <ul>
                    <li> ▪ 提供及时、详尽及准确的个人资料。</li>
                    <li> ▪ 不断更新注册资料，符合及时、详尽准确的要求。所有原始键入的资料将引用为注册资料。</li>
                </ul>
            </li>
            <li>用户可授权研伴文化交流中心向第三方透露其注册资料，否则研伴文化交流中心不能公开用户的姓名、住址、出生地址、电子邮箱、帐号。除非：
                <ul>
                    <li> ▪ 事先获得用户明确授权后，用户要求研伴文化交流中心或授权某人通过电子邮件服务或其他方式透露这些信息。</li>
                    <li> ▪ 相应的法律、法规要求以及按照有关政府主管部门的要求，需要研伴文化交流中心提供用户的个人资料。</li>
                    <li> ▪ 为了维护公众以及先登社区服务平台合法利益。</li>
                    <li> ▪ 先登社区服务平台可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与先登社区服务平台同等的保护用户隐私的责任，则先登社区服务平台有权将用户的注册资料等提供给该第三方。</li>
                    <li> ▪ 在不透露单个用户隐私资料的前提下，先登社区服务平台有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。</li>
                </ul>
            </li>
            <li>如果用户提供的资料不准确，不真实，不合法有效，研伴文化交流中心保留结束用户使用研伴文化交流中心各项服务的权利。用户在享用研伴文化交流中心各项服务的同时，同意接受研伴文化交流中心提供的各类信息服务。
            </li>
            <li>研伴文化交流中心定义的信息内容包括：文字、软件、声音、相片、录像、图表、在广告中全部内容、研伴文化交流中心为用户提供的商业信息等，所有这些内容受版权、商标权、和其它知识产权及所有权法律的保护。所以，用户只能在研伴文化交流中心授权下才能使用这些内容，而不能擅自复制、修改、编撰这些内容、或创造与内容有关的衍生产品。
            </li>
            <li>如果用户未遵守本服务条款的任何一项，研伴文化交流中心有权利即终止提供一切服务，并保留通过法律手段追究责任的权利。
            </li>
            <li>使用先登社区服务平台提供的服务由用户自己承担风险，在适用法律允许的最大范围内，研伴文化交流中心在任何情况下不就因使用或不能使用先登社区服务平台提供的服务所发生的特殊的、意外的、直接或间接的损失承担赔偿责任。即使已事先被告知该损害发生的可能性。
            </li>
            <li>用户须明白，使用先登社区服务平台提供的服务涉及到Internet服务和电信增值服务，可能会受到各个环节不稳定因素的影响。因此服务存在因不可抗力、计算机病毒或黑客攻击、国家相关行业主管部门及电信运营商的调整、系统不稳定、用户所在位置、用户关机以及其他任何技术、互联网络、通信线路原因等造成的服务中断或不能满足用户要求的风险。用户须承担以上风险，研伴文化交流中心不作担保。对因此导致用户不能发送、上传和接受阅读消息、或接发错消息，或无法实现其他通讯条件，研伴文化交流中心不承担任何责任。
            </li>
            <li>用户须明白，在使用先登社区服务平台提供的服务存在有来自任何他人的包括威胁性的、诽谤性的、令人反感的或非法的内容或行为或对他人权利的侵犯（包括知识产权）的匿名或冒名的信息的风险，用户须承担以上风险，研伴文化交流中心和合作公司对服务不作任何类型的担保，不论是明确的或隐含的，包括所有有关信息真实性、适用性、所有权和非侵权性的默示担保和条件，对因此导致任何因用户不正当或非法使用服务产生的直接、间接、偶然、特殊及后续的损害，不承担任何责任。
            </li>
        </ol>

        <h2>三、用户使用规则</h2>
        <p>特别提示用户，使用互联网必须遵守国家有关的政策和法律，包括刑法、国家安全法、保密法、计算机信息系统安全保护条例等，保护国家利益，保护国家安全，对于违法使用互联网络而引起的一切责任，由用户负全部责任。</p>
        <ol>
            <li>用户在申请使用先登社区服务平台提供的网络服务时，必须向研伴文化交流中心提供准确的个人资料，如个人资料有任何变动，必须及时更新。</li>
            <li>用户注册成功后，研伴文化交流中心将给予每个用户一个用户帐号及相应的密码，该用户帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。</li>
            <li>用户不得使用先登社区服务平台服务发送或传播敏感信息和违反国家法律制度的信息，包括但不限于下列信息：
                <ul>
                    <li>(a) 反对宪法所确定的基本原则的；</li>
                    <li>(b) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</li>
                    <li>(c) 损害国家荣誉和利益的；</li>
                    <li>(d) 煽动民族仇恨、民族歧视，破坏民族团结的；</li>
                    <li>(e) 破坏国家宗教政策，宣扬邪教和封建迷信的；</li>
                    <li>(f) 散布谣言，扰乱社会秩序，破坏社会稳定的；</li>
                    <li>(g) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</li>
                    <li>(h) 侮辱或者诽谤他人，侵害他人合法权益的；</li>
                    <li>(i) 含有法律、行政法规禁止的其他内容的。</li>
                </ul>
            </li>
            <li>用户在使用先登社区服务平台网络服务过程中，必须遵循以下原则：
                <ul>
                    <li>(a) 遵守中国有关的法律和法规；</li>
                    <li>(b) 不得为任何非法目的而使用网络服务系统；</li>
                    <li>(c) 遵守所有与网络服务有关的网络协议、规定和程序；</li>
                    <li>(d) 不得利用先登社区服务平台网络服务系统进行任何可能对互联网的正常运转造成不利影响的行为；</li>
                    <li>(e) 不得利用先登社区服务平台络服务系统传输任何骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；</li>
                    <li>(f) 不得利用先登社区服务平台络服务系统进行任何不利于研伴文化交流中心的行为。</li>
                </ul>
            </li>
            <li>使用先登社区服务平台网站服务，用户应加强个人资料的保护意识，并注意个人密码的密码保护。</li>
            <li>盗取他人用户帐号或利用网络通讯骚扰他人，均属于非法行为。用户不得采用测试、欺骗等任何非法手段，盗取其他用户的帐号和对他人进行骚扰。</li>
        </ol>

        <h2>四、服务条款的修改</h2>
        <p>研伴文化交流中心会在必要时修改服务条款，一旦本协议的内容发生变动，研伴文化交流中心将会直接在先登社区服务平台上公布修改之后的协议内容，该公布行为视为研伴文化交流中心已经通知用户修改内容。研伴文化交流中心也可通过其他适当方式向用户提示修改内容。如果不同意研伴文化交流中心对本协议相关条款所做的修改，用户有权停止使用网络服务。如果用户继续使用网络服务，则视为用户接受研伴文化交流中心对本协议相关条款所做的修改</p>

        <h2>五、服务修订</h2>
        <p>研伴文化交流中心特别提示用户，研伴文化交流中心为了保障公司业务发展和调整的自主权，拥有随时修改或中断服务而不需通知用户的权利，研伴文化交流中心行使修改或中断服务的权利不需对用户或任何第三方负责。用户必须在同意本条款的前提下，研伴文化交流中心才开始对用户提供服务。</p>

        <h2>六、用户隐私制度</h2>
        <p>尊重用户个人隐私是研伴文化交流中心的一项基本政策。所以，作为对以上第二点个人注册资料分析的补充，研伴文化交流中心一定不会公开、编辑或透露用户的注册资料及保存在研伴文化交流中心各项服务中的非公开内容，除非研伴文化交流中心在诚信的基础上认为透露这些信息在以下几种情况是必要的：</p>
        <ol>
            <li>遵守有关法律规定，包括在国家有关机关查询时，提供用户在先登社区服务平台的网页上发布的信息内容及其发布时间、互联网地址或者域名以及其他用户上传至先登社区服务平台的信息。</li>
            <li>遵从先登社区服务平台产品服务程序。</li>
            <li>保持维护研伴文化交流中心的商标所有权。</li>
            <li>在紧急情况下维护用户个人和社会大众的隐私安全。</li>
            <li>研伴文化交流中心认为必要的其他情况下。</li>
        </ol>
        <p>用户在此授权研伴文化交流中心可以向其电子邮箱发送商业信息。</p>

        <h2>七、用户的帐号、密码和安全性</h2>
        <p>用户一旦成功注册，将得到一个密码和帐号。如果用户未保管好自己的帐号和密码而对其自身、研伴文化交流中心或第三方造成的损害，用户将负全部责任。另外，每个用户都要对其帐户中的所有活动和事件负全责。用户可随时改变自己的密码和图标，也可以结束旧的帐户重开一个新帐户。用户同意若发现任何非法使用用户帐号或安全漏洞的情况，立即通告研伴文化交流中心。</p>

        <h2>八、隐私政策SDK说明</h2>
        <ol>
            <li>第三方插件使用情况
                <ul>
                    <li>（1）关键术语定义：设备信息：设备标识符（IMEI、IDFA、Android ID、MAC、OAID等相关信息）应用信息（应用崩溃信息、通知开关状态、软件列表等相关信息）、设备参数及系统信息（设备类型、设备型号、操作系统及硬件相关信息）网络信息：IP地址，WiFi信息，基站信息等相关信息。</li>
                    <li>（2）单独的某一设备信息是无法识别特定自然人身份的信息。如果我们将这类非个人信息与其他信息结合识别特定自然人身份，或将其与个人信息结合使用，则在结合使用期间，这类非个人信息将被视为个人信息，除非取得您的授权或法律法规另有规定外，我们会将这类信息做匿名化、去标识化处理。</li>
                    <li>（3）为了给您提供更专业、安全的核心业务功能和附加业务功能，我们的产品中会接入第三方插件产品（包括在我们的网页或应用程序中部署统计分析工具、软件开发工具包SDK、调用地图API接口）。</li>
                </ul>
            </li>
            <li>目前我们Android/Ios系统产品中存在的第三方插件披露如下：
                <ul>
                    <li>（1）百度地图（baidu_map）收集您的设备信息、位置信息以及网络状态，为您提供附近的专家机构等服务:北京百度网讯科技有限公司 <a href="https://map.baidu.com/zt/client/privacy/index.html">更多信息</a></li>
                    <li>（2）QQ SDK（open_sdk）收集您的网络状态信息，以根据您的指令实现账号的登录、以及资讯信息的分享； 深圳市腾讯计算机系统有限公司 <a href="https://privacy.qq.com/">更多信息</a></li>
                    <li>（3）微信SDK（tencent.wechat）收集您的网络状态信息，以根据您的指令实现账号的登录、以及资讯信息的分享、微信支付功能； 深圳市腾讯计算机系统有限公司 <a href="https://open.weixin.qq.com/">更多信息</a></li>
                    <li>（4）支付宝支付（alipay）SDK：使用您的网络权限以实现支付功能； 支付宝中国网络技术有限公司 <a href="https://render.alipay.com/p/c/k2cx0tg8">更多信息</a></li>
                    <li>（5）移动安全联盟设备标示SDK：获取移动智能终端补充设备标识体； 中国信息通信研究院 <a href="http://www.msa-alliance.cn/">更多信息</a></li>
                    <li>（6）极光推送（jPush）收集您的设备信息、网络信息、应用信息以及设备参数以及系统信息，为您提供精准的推送服务以及政策提醒 深圳市和讯华谷信息技术有限公司 <a href="https://www.jiguang.cn/license/privacy">更多信息</a></li>
                    <li>（7）华为推送SDK收集您的设备信息、运营商信息及网络状态用于华为设备的用户进行消息推送； 华为技术有限公司 <a href="https://consumer.huawei.com/cn/privacy/privacy-policy/">更多信息</a></li>
                    <li>（8）小米推送SDK收集您的设备信息、运营商信息及网络状态用于小米设备的用户进行消息推送； 小米科技有限公司 <a href="https://dev.mi.com/console/doc/detail?pId=1822">更多信息</a></li>
                    <li>（9）OPPO推送SDK收集您的设备信息、运营商信息及网络状态用于OPPO设备的用户进行消息推送；OPPO广东移动通信有限公司 <a href="https://www.oppo.com/cn/service/help/640?id=640&name=服务政策&hdscreen=1">更多信息</a></li>
                    <li>（10）VIVO推送SDK收集您的设备信息、运营商信息及网络状态用于VIVO设备的用户进行消息推送； 维沃移动通信有限公司 <a href="https://www.vivo.com.cn/about-vivo/privacy-policy">更多信息</a></li>
                    <li>（11）GrowingIO：使用GrowingIO平台SDK统计App内部页面访问数据，如用户登录统计，页面访问率，按钮点击率等； 北京易数科技有限公司 <a href="https://www.growingio.com/">更多信息</a></li>
                </ul>
            </li>
        </ol>

        <h2>九、拒绝提供担保</h2>
        <p>研伴文化交流中心不担保服务一定能满足用户的要求，也不担保服务不会受中断，对服务的及时性、安全性、出错发生都不作担保。研伴文化交流中心拒绝提供任何担保，包括信息能否准确、及时、顺利地传送。用户理解并接受下载或通过研伴文化交流中心产品服务取得的任何信息资料取决于用户自己，并由其承担系统受损或资料丢失的所有风险和责任。研伴文化交流中心对在服务网上得到的任何商品购物服务或交易进程，都不作担保。用户不会从研伴文化交流中心收到口头或书面的意见或信息，研伴文化交流中心也不会在这里作明确担保。</p>

        <h2>十、有限责任</h2>
        <p>研伴文化交流中心对直接、间接、偶然、特殊及继起的损害不负责任，这些损害来自：不正当使用产品服务，在网上购买商品或类似服务，在网上进行交易，非法使用服务或用户传送的信息有所变动。用户的上述行为引起对研伴文化交流中心或第三方的损害，应当依法承担责任并向研伴文化交流中心进行赔偿，研伴文化交流中心可以自行或协助第三方使用用户提供的任何信息进行维权。</p>

        <h2>十一、未经研伴文化交流中心同意禁止进行商业性行为</h2>
        <p>用户承诺不经研伴文化交流中心书面同意，不能利用研伴文化交流中心各项服务在先登社区服务平台或相关网站上进行销售或其他商业性行为。用户违反此约定，研伴文化交流中心将依法追究其违约责任，由此给研伴文化交流中心造成损失的，研伴文化交流中心有权进行追偿。</p>

        <h2>十二、先登社区服务平台用户信息的储存及限制</h2>
        <p>研伴文化交流中心不对用户所发布信息的删除或储存失败负责。研伴文化交流中心保留判定用户的行为是否符合先登社区服务平台服务条款的要求和精神的权利，如果用户违背了服务条款的规定，则中断或删除其帐号。</p>

        <h2>十三、结束服务</h2>
        <p>用户或研伴文化交流中心可随时根据实际情况中断服务。研伴文化交流中心不需对任何个人或第三方负责而随时中断服务。用户若反对任何服务条款的建议或对后来的条款修改有异议，或对研伴文化交流中心服务不满，用户享有以下的追索权：</p>
        <ol>
            <li>不再使用先登社区服务平台的服务。</li>
            <li>结束用户使用先登社区服务平台服务的资格。</li>
            <li>书面通告研伴文化交流中心停止该用户的服务。</li>
        </ol>
        <p>结束用户服务后，用户使用先登社区服务平台服务的权利马上中止。从那时起，研伴文化交流中心不再对用户承担任何义务。</p>

        <h2>十四、通告</h2>
        <p>所有发给用户的通告都可通过电子邮件或常规的信件传送。研伴文化交流中心会通过邮件服务发报消息给用户，告诉他们服务条款的修改、服务变更、或其它重要事情。同时， 研伴文化交流中心保留对先登社区服务平台用户投放商业性广告的权利。</p>

        <h2>十五、参与广告策划</h2>
        <p>在研伴文化交流中心书面许可下用户可在他们发表的信息中加入宣传资料或参与广告策划，在先登社区服务平台各项免费服务上展示他们的产品。任何这类促销方法，包括运输货物、付款、服务、商业条件、担保及与广告有关的描述都只是在相应的用户和广告销售商之间发生。 研伴文化交流中心不承担任何责任，研伴文化交流中心没有义务为这类广告销售负任何一部分的责任。</p>

        <h2>十六、知识产权</h2>
        <p>用户保证和声明对其所提供的作品拥有完整的合法的著作权或完整的合法的授权可以用于其在先登社区服务平台上从事的活动，保证研伴文化交流中心使用该作品不违反国家的法律法规，也不侵犯第三方的合法权益或承担任何义务。用户应对其所提供作品因形式、内容及授权的不完善、不合法所造成的一切后果承担完全责任。用户同意研伴文化交流中心对其创作并上传的作品在全世界范围内享有免费的、永久性的、不可撤消的、独家的和完全的许可和再许可权利，以使用、复制、出版、发行、以原有或其他形式进行改编、转载、翻译、传播、表演和展示此等内容（整体或部分）。此许可和再许可权利包括但不限于此作品的著作权、邻接权及获得利益等权利。用户同时承诺，不就上述作品以及上述作品的改编作品对任何第三方进行任何形式的许可使用。对于经用户本人创作并上传到先登社区服务平台的文本、图片、图形、音频和/或视频等资料的商标和/或其它财产权利归属于研伴文化交流中心，未经研伴文化交流中心同意，用户保证不以任何形式直接或间接发布、播放、出于播放或发布目的而改编或再发行，或者用于其他任何商业目的。同时保证不许可任何第三方从事上述行为。研伴文化交流中心保留对先登社区服务平台网站所有内容进行实时监控的权利，并有权依其独立判断对任何违反本协议约定的作品实施删除。研伴文化交流中心对于删除用户作品引起的任何后果或导致用户的任何损失不负任何责任。因用户作品的违法或侵害第三人的合法权益而导致研伴文化交流中心或其关联公司对第三方承担任何性质的赔偿、补偿或罚款而遭受损失（直接的、间接的、偶然的、惩罚性的和继发的损失），用户对于研伴文化交流中心或其关联公司蒙受的上述损失承担全面的赔偿责任。</p>

        <h2>十七、言论</h2>
        <p>用户承诺发表言论要：爱国、守法、自律、真实、文明。不传输任何非法的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、危害国家安全的、泄露国家机密的、破坏国家宗教政策和民族团结的以及其它违反法律法规及政策的内容。若用户的行为不符合以上提到的服务条款， 研伴文化交流中心将作出独立判断立即取消用户服务帐号。用户需对自己在网上的行为承担法律责任。</p>

        <h2>十八、内容的所有权</h2>
        <p>内容的定义包括：文字、软件、声音、相片、录象、图表；在广告中的全部内容；电子邮件的全部内容；先登社区服务平台为用户提供的商业信息。所有这些内容均受版权、商标、标签和其它财产所有权法律的保护。所以，用户只能在研伴文化交流中心和广告商授权下才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。</p>

        <h2>十九、免责与赔偿声明</h2>
        <ol>
            <li>若研伴文化交流中心已经明示先登社区服务平台服务提供方式发生变更并提醒用户应当注意事项，用户未按要求操作所产生的一切后果由用户自行承担。</li>
            <li>用户明确同意其使用先登社区服务平台的服务所存在的风险将完全由其自己承担；因其使用先登社区服务平台的服务而产生的一切后果也由其自己承担，研伴文化交流中心对用户不承担任何责任。</li>
            <li>研伴文化交流中心不担保先登社区服务平台的服务一定能满足用户的要求，也不担保其服务不会中断，对其服务的及时性、安全性、准确性也都不作担保。</li>
            <li>用户同意保障和维护研伴文化交流中心及其他用户的利益，由于用户登录网站内容违法、不真实、不正当、侵犯第三方合法权益，或用户违反本协议项下的任何条款而给研伴文化交流中心或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。</li>
        </ol>

        <h2>二十、法律</h2>
        <p>如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决。协商不成时，任何一方均可向研伴文化交流中心所在地的人民法院提起诉讼。若有任何服务条款与法律相抵触，那这些条款将按尽可能接近的方法重新解析，而其它条款则保持对用户产生法律效力和影响。</p>

        <h2>二十一、青少年用户特别提示</h2>
        <ol>
            <li>青少年及使用先登社区服务平台服务应该在父母和老师的指导下，正确学习使用网络。青少年避免沉迷虚拟的网络世界而影响日常的学习生活。</li>
            <li>青少年用户必须遵守全国青少年网络文明公约：
                <ul>
                    <li>要善于网上学习，不浏览不良信息；</li>
                    <li>要诚实友好交流，不侮辱欺诈他人；</li>
                    <li>要增强自护意识，不随意约会网友；</li>
                    <li>要维护网络安全，不破坏网络秩序；</li>
                    <li>要有益身心健康，不沉溺虚拟时空。</li>
                </ul>
            </li>
        </ol>

        <h2>二十二、帐号的冻结</h2>
        <p>先登社区服务平台帐号的失效期为3个月。如果一个帐号连续3个月不曾使用，即没有以Web方式登录，届时其原有信息将全部丢失。用户已经获悉，为了保证登录的顺利及有效，3个月内至少要使用一次。</p>

        <h2>二十三、其他</h2>
        <ol>
            <li>研伴文化交流中心将视向用户所提供服务内容之特性，要求用户在注册研伴文化交流中心提供的有关服务时，遵守特定的条件和条款；如该特定条件和条款与以上服务条款有任何不一致之处，则以特定条件和条款为准。</li>
            <li>本服务条款中的任何条款无论因何种原因完全或部分无效或不具有执行力，其余条款仍应有效并且有约束力。</li>
            <li>本服务条款执行过程中所产生的任何问题，本网站和用户都将友好协商解决。</li>
            <li>以上条款的解释权归研伴文化交流中心最终所有。</li>
        </ol>
        <a-divider />
        <!-- <a-button @click="backToPrevious" type="link" class="flex items-center mb-10"><BackwardOutlined />返回上一页</a-button> -->
    </div>
</template>

<style ></style>

<script setup lang="ts">
// import { BackwardOutlined } from '@ant-design/icons-vue';
// import { useRouter } from 'vue-router';

// const router = useRouter();
// function backToPrevious() {
//     router.back()
// }
</script>